#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-lambda-cost.data.archive_file.aws_lambda_cost will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "aws_lambda_cost"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/aws-lambda-cost/lambda.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "modules/aws-lambda-cost/main.py"
      + type                = "zip"
    }

  # module.aws-lambda-cost.aws_iam_role.aws_lambda_cost must be replaced
-/+ resource "aws_iam_role" "aws_lambda_cost" {
      ~ arn                   = "arn:aws:iam::589845989135:role/terraform-20200229080729940800000001" -> (known after apply)
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = "sts:AssumeRole" -> [
                          + "sns:List*",
                          + "sns:Get*",
                          + "logs:TestMetricFilter",
                          + "logs:List*",
                          + "logs:Get*",
                          + "logs:FilterLogEvents",
                          + "logs:Describe*",
                          + "cloudwatch:List*",
                          + "cloudwatch:Get*",
                          + "cloudwatch:Describe*",
                          + "autoscaling:Describe*",
                        ]
                        Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        } -> null
                      + Resource  = "*"
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2020-02-29T08:07:30Z" -> (known after apply)
        force_detach_policies = false
      ~ id                    = "terraform-20200229080729940800000001" -> (known after apply)
        max_session_duration  = 3600
      ~ name                  = "terraform-20200229080729940800000001" -> "aws-lambda-cost" # forces replacement
        path                  = "/"
      - tags                  = {} -> null
      ~ unique_id             = "AROAYSVMPQ4H6R3KYCSVO" -> (known after apply)
    }

  # module.aws-lambda-cost.aws_lambda_function.aws_lambda_cost will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_cost" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost"
        filename                       = "modules/aws-lambda-cost/lambda.zip"
        function_name                  = "aws-lambda-cost"
        handler                        = "lambda_function.lambda_handler"
        id                             = "aws-lambda-cost"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost/invocations"
      ~ last_modified                  = "2020-02-29T08:07:38.120+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost:$LATEST"
        reserved_concurrent_executions = -1
      ~ role                           = "arn:aws:iam::589845989135:role/terraform-20200229080729940800000001" -> (known after apply)
        runtime                        = "python3.7"
      ~ source_code_hash               = "DU658dBnDFI3lnrFlLyPAYRkvM0N+Nup5XjQSuTp1JI=" -> (known after apply)
        source_code_size               = 951
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "SLACK_WEBHOOK" = "https://hooks.slack.com/services/XXXXXXXXXXXXXXXXXXXXXXXXXXX"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
